cylinder_2D_Re0.1/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;

sourceCase ".";
sourcePatches (lowerwall);

exposedPatchName upperwall;

flipNormals false;

extrudeModel        linearNormal;

nLayers             1;

linearNormalCoeffs
{
    thickness       0.01;
}

mergeFaces false;

// Merge small edges. Fraction of bounding box.
//mergeTol 0;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
