cylinder_2D_Re0.1/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{


    inlet
    {
      type            fixedValue;
      value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue  uniform (0.1 0 0);
        value           $internalField;
    }

    sidewall
    {
        type            inletOutlet;
        inletValue  uniform (0.1 0 0);
        value           $internalField;
    }

    upperwall
    {
        type            empty;
    }

    lowerwall
    {
        type            empty;
    }

    cylinder
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }

}


// ************************************************************************* //
