cylinder_2D_Re0.1/system/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Q1
{
    type  vorticity;
    libs	("libfieldFunctionObjects.so");
    writeControl	writeTime;
}



// ************************************************************************* //
